In [1]:
import pandas as pd 

import numpy as np

In [2]:
import pandas as pd

a = pd.read_csv('C:/Users/pau_a/Documents de Paula en disco/Notebooks/notebook_uno/ds_salaries.csv')

In [3]:
int(a.duplicated().sum())

1171

In [4]:
a.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [5]:
a.duplicated().sum()

np.int64(1171)

In [6]:
a.drop_duplicates(inplace=True) #eliminar duplicados, no esta activada porque quita los valores de la columna experience_level

In [20]:
a.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

- ¿De que pais son la mayoria de compañias?

In [8]:
maxnum_companies = a.loc[(a['company_size'] == 'L', ['company_location'])].value_counts()
maxnum_companies.head(1)

company_location
US                  220
Name: count, dtype: int64

- Tipo de trabajo, pais de residencia donde se cobra más?

In [9]:
job_salary = a.groupby(['job_title', 'company_location'])['salary_in_usd'].max().reset_index()
job_max_salary = job_salary.sort_values(by='salary_in_usd', ascending=False)

job_max_salary.head(5)

                              job_title company_location  salary_in_usd
351                  Research Scientist               US         450000
101                        Data Analyst               GB         430967
20                         AI Scientist               IL         423834
40   Applied Machine Learning Scientist               US         423000
331            Principal Data Scientist               US         416000

 - ¿El nivel de  experiencia es proporcional al salario? 

 - ¿cuanto se cobra de media por cada nivel de experiencia?

Si los datos en la columna experience_level no son numéricos. pd.to_numeric().

In [37]:
nv_exp = a.groupby(['experience_level', 'employment_type'])['salary_in_usd'].mean().reset_index()

nv_exp

   experience_level employment_type  salary_in_usd
0                EN              CT   65234.500000
1                EN              FL   75000.000000
2                EN              FT   74564.626984
3                EN              PT   38885.000000
4                EX              CT  416000.000000
5                EX              FT  188710.610526
6                MI              CT   78600.000000
7                MI              FL   41615.600000
8                MI              FT  102742.781874
9                MI              PT   42561.000000
10               SE              CT   97500.000000
11               SE              FL   53333.333333
12               SE              FT  154165.019367

- ¿En que nivel de experiencia hay mas empleados?

In [43]:
exp_lev = a['experience_level'].value_counts()
exp_lev

experience_level
SE    1554
MI     664
EN     270
EX      96
Name: count, dtype: int64